package com.example.davod.khayyam;

/**
 * Created by DaVoD on 1/11/2018.
 */

public class PoemHolder {
    private static String[] poem;

    public static String[] getPoem(int id, int number) {
        if (id < 0)
            id *= (-1);

        switch (id) {
            case 1:
                //هدف آفرینش
                switch (number) {
                    case 1:
                        poem = new String[]{"هرچند که رنگ و بوی زیباست مرا", "چون لاله رخ و چو سرو بالاست مرا", "معلوم نشد که در طربخانه ی خاک", "نقاش ازل بهر چه آراست مرا"};
                        break;
                    case 2:
                        poem = new String[]{"آورد به اِضطرارم اوّل به وجود", "جز حیرتم از حیات چیزی نفزود", "رفتیم به اِکراه و ندانیم چه بود", "زین آمدن و بودن و رفتن مقصود!"};
                        break;
                    case 3:
                        poem = new String[]{"چون آمدنم به من نَبُد روز نخست", "واین رفتن بی مراد عزمی است درست", "برخیز و میان ببند ای ساقی چُست", "کاندوه جهان به مِی فرو خواهم شست"};
                        break;
                    case 4:
                        poem = new String[]{"چون نیست حقیقت و یقین اندر دست", "نتوان به امید و شک همه عمر نشست", "هان تا ننهیم جام می از کف دست", "در بی خبری مرد چه هشیار و چه مست"};
                        break;
                    case 5:
                        poem = new String[]{"در پرده اسرار کسی را ره نیست", "زین تعبیه جان هیچکس آگه نیست", "جز در دل خاک هیچ منزلگه نیست", "می خور که چنین فسانه ها کوته نیست"};
                        break;
                    case 6:
                        poem = new String[]{"کس مشکل اسرار اجل را نگشاد", "کس یک قدم از دایره بیرون ننهاد", "من می نگرم ز مبتدی تا استاد", "عجز است به دست هر که از مادر زاد"};
                        break;
                    case 7:
                        poem = new String[]{"آن بیخبران که دُرّ ِ معنی سُفتند", "در چرخ به انواعْ سخن ها گفتند", "آگه چو نگشتند بر اَسرارِ جهان", "اول زَنَخی زدند و آخر خفتند!"};
                        break;
                    case 8:
                        poem = new String[]{"آنان  که محیطِ فضل و آداب شدند", "در جمعِ کمال شمعِ اَصحاب شدند", "رَه زین شبِ تاریک نبردند به روز", "گفتند فسانه ای و در خواب شدند"};
                        break;
                    case 9:
                        poem = new String[]{"دارنده چو ترکیبِ طِبایع آراست", "از بهرِ چه او فْکَنْدَش اندر کم و کاست؟", "گر نیک آمد، شکستن از بهرِ چه بود؟", "ور نیک نیامد این صُوَر، عیب کراست"};
                        break;
                    case 10:
                        poem = new String[]{"می پرسیدی که چیست این نقشِ مجاز", "گر برگویم حقیقتش هست دراز", "نقشی است پدید آمده از دریایی", "و آنگاه شده به قَعْرِ آن دریا باز"};
                        break;
                    case 11:
                        poem = new String[]{"اسرار اَزَل را نه تو دانی و نه من", "وین حرفِ معمّا نه تو خوانی و نه من", "هست از پس پرده گفت و گوی من و تو", "چون پرده برافتد، نه تو مانی و نه من"};
                        break;
                    case 12:
                        poem = new String[]{"قومی متفکرند اندر ره دین", "قومی به گمان فتاده در راه یقین", "می ترسم از آن که بانگ آید روزی", "کای بیخبران راه نه آنست و نه این"};
                        break;
                    case 13:
                        poem = new String[]{"دل سِرّ حیات اگر کَماهی دانست", "در مرگ هم اسرار الهی دانست", "امروز که با خودی، ندانستی هیچ", "فردا که ز خود رَوی چه خواهی دانست؟"};
                        break;
                    case 14:
                        poem = new String[]{"این بحرِ وجود آمده بیرون ز نهفت", "کس نیست که این گوهرِ تحقیق بِسُفْت", "هرکس سخنی از سَرِ سودا گفته است", "زان روی که هست، کس نمی داند گفت"};
                        break;
                    case 15:
                        poem = new String[]{"اَجرام که ساکنان این ایوان اند", "اسبابِ تَرَدُّدِ خردمندان اند", "هان تا سرِ رشتهٔ خِرَد گُم نکنی", "کانان که مُدَبّرند سرگردان اند"};
                        break;
                    case 16:
                        poem = new String[]{"گاوی است بر آسمان قَرینِ پروین", "گاوی است دگر نهفته در زیر زمین", "گر بینایی، چشمِ حقیقت بگشا:", "زیر و زَبَرِ دو گاو مشتی خر بین"};
                        break;
                    case 17:
                        poem = new String[]{"یک قطرهٔ آب بود و با دریا شد", "یک ذرّهٔ خاک و با زمین یکتا شد", "آمد شدن تو اندرین عالم چیست؟", "آمد مگسی پدید و ناپیدا شد"};
                        break;
                    case 18:
                        poem = new String[]{"اجزای پیاله ای که درهم پیوست", "بشکستنِ آن روا نمی دارد مست", "چندین سر و ساقِ نازنین و کفِ دست", "از مِهرِ که پیوست و به کینِ که شکست؟"};
                        break;
                    case 19:
                        poem = new String[]{"من ظاهرِ نیستی و هستی دانم", "من باطنِ هر فراز و پستی دانم", "با این همه از دانشِ خود شَرْمَم باد", "گر مرتبه ای وَرایِ مستی دانم"};
                        break;
                    case 20:
                        poem = new String[]{"بر لوحْ نشانِ بودنی ها بوده است", "پیوسته قلم ز نیک و بد فرسوده است", "در روز ازل هر آن چه بایست بداد", "غم خوردن و کوشیدنِ ما بیهوده است"};
                        break;
                    case 21:
                        poem = new String[]{"چون روزی و عمر بیش وکم نتوان کرد", "خود را به کم و بیش دُژَم نتوان کرد", "کار من و تو چنان که رأی من و تو ست", "از موم به دست خویش هم نتوان کرد"};
                        break;
                    case 22:
                        poem = new String[]{"در گوشِ دلم گفت فلک پنهانی:", "حُکمی که قضا بُوَد ز من می دانی؟", "در گردشِ خود اگر مرا دست بُدی", "خود را برهاندمی ز سر گردانی"};
                        break;
                }
                break;
            case 2:
                //ازل و اجل
                switch (number) {
                    case 1:
                        poem = new String[]{"ماییم و می و مطرب و این کنج خراب", "جان و دل و جام و جامه پر دُرد شراب", "فارغ ز امید رحمت و بیم عذاب", "آسوده ز خاک و باد و از آتش و آب"};
                        break;
                    case 2:
                        poem = new String[]{"در دایره ای که آمد و رفتن ماست", "آن را نه بدایت نه نهایت پیداست", "کس می نزند دمی در این معنی راست", "کاین آمدن از کجا و رفتن به کجاست"};
                        break;
                    case 3:
                        poem = new String[]{"گویند کسان بهشت با حور خوش است", "من میگویم که آب انگور خوش است", "این نقد بگیر و دست از آن نسیه بدار", "کآواز دهل شنیدن از دور خوش است"};
                        break;
                    case 4:
                        poem = new String[]{"گویند که دوزخی بود عاشق و مست", "قولی است خلاف دل در آن نتوان بست", "گر عاشق و مست دوزخی خواهد بود", "فردا باشد بهشت همچون کف دست"};
                        break;
                    case 5:
                        poem = new String[]{"تا چند زنم بروی دریاها خشت", "بیزار شدم ز بت پرستان کنشت", "خیام که گفت دوزخی خواهد بود", "که رفت بدوزخ و که آمد ز بهشت"};
                        break;
                    case 6:
                        poem = new String[]{"بسیار بگشتیم به گرد در و دشت", "واندر همه آفاق بگشتیم به گشت", "کس را نشنیدیم که آمد زین راه", "یعنی همه رفتند و یکی بازنگشت"};
                        break;
                    case 7:
                        poem = new String[]{"من هیچ ندانم که مرا آنکه سرشت", "از اهل بهشت کرد یا دوزخ زشت", "جامی و بتی و بربطی بر لب کشت", "این هر سه مرا نقد و ترا نسیه بهشت"};
                        break;
                    case 8:
                        poem = new String[]{"تا کی ز چراغ مسجد و دود کِنِشت؟", "تا کی ز زیان دوزخ و سود بهشت؟", "رو بر سر لوح بین که استاد قضا", "اندر ازل آنچه بودنی بود نوشت"};
                        break;
                    case 9:
                        poem = new String[]{"ای آمده از عالم روحانی، تفت", "حیران شده در پنج و چهار و شش و هفت", "می نوش ندانی ز کجا آمده ای", "خوش باش ندانی به کجا خواهی رفت"};
                        break;
                    case 10:
                        poem = new String[]{"افسوس که سرمایه ز کف بیرون شد", "وز دست اجل بسی جگرها خون شد", "کس نامد از آن جهان که پرسم از او", "کاحوال مسافران دنیا چون شد"};
                        break;
                    case 11:
                        poem = new String[]{"ای دل تو به ادراکِ معمّا نرسی", "در نکتهٔ زیرکانِ دانا نرسی", "اینجا ز می و جام بهشتی می ساز", "کآنجا که بهشت است رسی یا نرسی"};
                        break;
                    case 12:
                        poem = new String[]{"گویند بهشت و حور و کوثر باشد", "جوی می و شیر و شهد و شکر باشد", "پر کن قدح باده و بر دستم نه", "نقدی ز هزار نسیه خوشتر باشد"};
                        break;
                    case 13:
                        poem = new String[]{"گویند هر آن کسان که با پرهیزند", "زانسان که بمیرند چنان برخیزند", "ما با می و معشوقه از آنیم مدام", "باشد که به حشرمان چنان انگیزند"};
                        break;
                    case 14:
                        poem = new String[]{"ای بس که نباشیم و جهان خواهد بود", "نی نام زما و نی نشان خواهد بود", "زین پیش نبودیم و نبد هیچ خلل", "زین پس چو نباشیم همان خواهد بود"};
                        break;
                    case 15:
                        poem = new String[]{"گویند بهشت و حورعین خواهد بود", "آنجا می و شیر و انگبین خواهد بود", "گر ما می و معشوق گزیدیم چه باک", "چون عاقبت کار چنین خواهد بود"};
                        break;
                    case 16:
                        poem = new String[]{"از آمدنم نبود گردون را سود", "وز رفتن من جلال و جاهش نفزود", "وز هیچ کسی نیز دو گوشم نشنود", "کاین آمدن و رفتنم از بهر چه بود"};
                        break;
                    case 17:
                        poem = new String[]{"از جمله رفتگان این راه دراز", "باز آمده کیست تا بما گوید باز", "پس بر سر این دو راههٔ آز و نیاز", "تا هیچ نمانی که نمی آیی باز"};
                        break;
                    case 18:
                        poem = new String[]{"وقت سحر است، خیز ای مایهٔ ناز", "نرمک نرمک باده خور و چنگ نواز", "کآنها که بجای اند نپایند بسی", "و آنها که شدند کس نمی آید باز"};
                        break;
                    case 19:
                        poem = new String[]{"خیام اگر ز باده مستی خوش باش", "با لاله رخی اگر نشستی خوش باش", "چون عاقبت کار جهان نیستی است", "انگار که نیستی چو هستی خوش باش"};
                        break;
                    case 20:
                        poem = new String[]{"کس خلد و جحیم را ندیده است ای دل", "آن کیست کز آن جهان رسیده است ای دل", "امّید و هراس ما به چیزی است کز آن", "جز نام و نشانی نه پدید است ای دل"};
                        break;
                    case 21:
                        poem = new String[]{"بر مفرش خاک خفتگان می بینم", "در زیرزمین نهفتگان می بینم", "چندانکه به صحرای عدم مینگرم", "ناآمدگان و رفتگان می بینم"};
                        break;
                    case 22:
                        poem = new String[]{"پیری دیدم به خانه ی خماری", "گفتم نکنی ز رفتگان اخباری ؟", "گفتا می خور که همچو ما بسیاری", "رفتند و خبر باز نیامد باری"};
                        break;
                    case 23:
                        poem = new String[]{"افلاک که جز غم نفزایند دگر", "نَنْهَند به جا تا نربایند دگر", "نا آمدگان اگر بدانند که ما", "از دَهْر چه می کشیم، نایند دگر"};
                        break;
                    case 24:
                        poem = new String[]{"ای آن که نتیجهٔ چهار و هفتی", "وز هفت و چهار دایم اندر تَفْتی", "می خور که هزار باره بیشت گفتم:", "باز آمدنت نیست، چو رفتی رفتی"};
                        break;
                }
                break;
            case 3:
                switch (number) {
                    //عاقبت عمر
                    case 1:
                        poem = new String[]{"هر سبزه که برکنار جویی رسته است", "گویی ز لب فرشته خویی رسته است", "پا بر سر سبزه تا به خواری ننهی", "کان سبزه ز خاک لاله رویی رسته است"};
                        break;
                    case 2:
                        poem = new String[]{"این کوزه چو من عاشق زاری بوده است", "در بند سر زلف نگاری بوده ست", "این دسته که بر گردن او می بینی", "دستی ست که برگردن یاری بوده ست"};
                        break;
                    case 3:
                        poem = new String[]{"در هر دشتی که لاله زاری بوده ست", "از سرخی خون شهریاری بوده ست", "هر شاخ بنفشه کز زمین میروید", "خالی است که بر رخ نگاری بوده ست"};
                        break;
                    case 4:
                        poem = new String[]{"پیش از من و تو لیل و نهاری بوده است", "گردنده فلک نیز بکاری بوده است", "هرجا که قدم نهی تو بر روی زمین", "آن مردمک چشم نگاری بوده است"};
                        break;
                    case 5:
                        poem = new String[]{"خاکی که به زیر پای هر نادانی است", "زلف صنمیّ و چهره ی جانانی است", "هر خشت که بر کنگره ی ایوانی است", "انگشت وزیر و لب سلطانی است"};
                        break;
                    case 6:
                        poem = new String[]{"چون ابر به نوروز رخ لاله بشست", "برخیز و بجام باده کن عزم درست", "کاین سبزه که امروز تماشاگه توست", "فردا همه از خاک تو برخواهد رست"};
                        break;
                    case 7:
                        poem = new String[]{"ابر آمد و باز بر سر سبزه گریست", "بی باده ی گلرنگ نمی باید زیست", "این سبزه که امروز تماشاگه ماست", "تا سبزه ی خاک ما تماشاگه کیست"};
                        break;
                    case 8:
                        poem = new String[]{"چون چرخ بکام یک خردمند نگشت", "خواهی تو فلک هفت شمر خواهی هشت", "چون باید مرد و آرزوها همه هشت", "چه مور خورد بگور و چه گرگ بدشت"};
                        break;
                    case 9:
                        poem = new String[]{"آن قصر که جمشید در او جام گرفت", "آهو بچه کرد و روبه آرام گرفت", "بهرام که گور می گرفتی همه عمر", "دیدی که چگونه گور بهرام گرفت"};
                        break;
                    case 10:
                        poem = new String[]{"جامی است که عقل آفرین می زندش", "صد بوسه زِ مِهْر بر جَبین می زندش", "این کوزه گر دَهْر چنین جامِ لطیف", "می سازد و باز بر زمین می زندش!"};
                        break;
                    case 11:
                        poem = new String[]{"چون عمر به سر رسد چه شیرین و چه تلخ", "پیمانه چو پر شود چه بغداد و چه بلخ", "می نوش که بعد از من و تو ماه بسی", "از سَلخ به غٌرّه آید از غره به سلخ"};
                        break;
                    case 12:
                        poem = new String[]{"بر چرخ فلک هیچ کسی چیر نشد", "وز خوردن آدمی زمین سیر نشد", "مغرور بدانی که نخورده ست ترا", "تعجیل مکن، هم بخورد، دیر نشد"};
                        break;
                    case 13:
                        poem = new String[]{"از جرم گِل سیاه تا اوج زحل", "کردم همه مشکلات کلی را حل", "بگشادم بندهای مشکل به حیل", "هر بند گشاده شد مگر بند اجل"};
                        break;
                    case 14:
                        poem = new String[]{"هر یک چندی یکی برآید که منم", "با نعمت و با سیم و زر آید که منم", "چون کارک او نظام گیرد روزی", "ناگه اجل از کمین برآید که منم"};
                        break;
                    case 15:
                        poem = new String[]{"یک چند به کودکی باستاد شدیم", "یک چند به استادی خود شاد شدیم", "پایان سخن شنو که ما را چه رسید", "از خاک در آمدیم و بر باد شدیم"};
                        break;
                    case 16:
                        poem = new String[]{"هنگام صبوح ای صنمِ فرخْ پی", "برساز ترانه ای و پیش آور می", "کافکند به خاک صد هزاران جَم و کیْ", "این آمدنِ تیرمه و رفتنِ دی"};
                        break;
                    case 17:
                        poem = new String[]{"ساقی، گل و سبزه بس طربناک شده است", "دریاب که هفتهٔ دگر خاک شده است", "می نوش و گُلی بچین، که تا در نگریْ", "گل خاک شده است و سبزه خاشاک شده است"};
                        break;
                    case 18:
                        poem = new String[]{"چون لاله به نوروز قدح گیر به دست", "با لاله رخی اگر تو را فرصت هست", "می نوش به خرمی، که این چرخِ کبودْ", "ناگاه تو را چو خاک گرداند پَست"};
                        break;
                    case 19:
                        poem = new String[]{"در دایرهِٔ سپهرِ ناپیدا غور", "می نوش به خوشدلی که دور است به جور", "نوبت چو به دوْرِ تو رَسَد آه مکنْ", "جامی است که جمله را چشانند به دوْر!"};
                        break;
                    case 20:
                        poem = new String[]{"یارانِ موافق همه از دست شدند", "در پای اجل یکان یکان پَست شدند", "بودیم به یک شراب در مجلسِ عمر", "یک دَوْر ز ما پیشترک مست شدند!"};
                        break;
                    case 21:
                        poem = new String[]{"ای چرخِ فلک خرابی از کینهٔ توست", "بیداد گری پیشهٔ دیرینهٔ توست", "وی خاک اگر سینهٔ تو بشکافند", "بس گوهر قیمتی که در سینهٔ توست"};
                        break;
                    case 22:
                        poem = new String[]{"عالَم اگر ازبهرِ تو می آرایند", "مَگْرای بدان که عاقلان نگرایند", "بسیار چو تو روند و بسیار آیند", "بربای نصیبِ خویش کِتْ بربایند"};
                        break;
                    case 23:
                        poem = new String[]{"می خور که به زیرِ گِل بسی خواهی خفت", "بی مونس و بی رفیق و بی همدم و جفت", "زنهار به کس مگو تو این رازِ نهفت:", "هر لاله که پَژْمُرد، نخواهد بِشْکفت"};
                        break;
                    case 24:
                        poem = new String[]{"ما لُعْبَتِگانیم و فلک لُعبَت باز", "از روی حقیقتی نه از روی مَجاز", "یک چند درین بساط بازی کردیم", "رفتیم به صندوقِ عدم یک یک باز!"};
                        break;
                    case 25:
                        poem = new String[]{"این کهنه رباط را که عالم نام است", "آرامگَهِ اَبْلَقِ صبح و شام است", "بزمی است که واماندهٔ صد جمشید است", "گوری است که خوابگاهِ صد بهرام است!"};
                        break;
                    case 26:
                        poem = new String[]{"مرغی دیدم نشسته بر بارهٔ توس", "در چنگ گرفته کلّهٔ کیکاوس", "با کلّه همی گفت که: افسوس، افسوس!", "کو بانک جَرَس ها و کجا نالهٔ کوس؟"};
                        break;
                    case 27:
                        poem = new String[]{"آن قصر که بر چرخ همی زد پهلو", "بر درگهِ او شهان نهادندی رو", "دیدیم که بر کنگره اش فاخته ای", "بنشسته همی گفت که: «کوکو، کوکو؟»"};
                        break;
                    case 28:
                        poem = new String[]{"از تن چو برفت جان پاک من و تو", "خشتی دو نهند بر مَغاکِ من و تو", "و آنگه زِ برایِ خشتِ گورِ دگران", "در کالبدی کشند خاکِ من و تو"};
                        break;
                    case 29:
                        poem = new String[]{" هر ذره که بر روی زمینی بوده است", "خورشید رُخی، زُهره جَبینی بوده است", "گَرْد از رخِ آستین به آزَرْم فشان", "کان هم رخِ خوب نازنینی بوده است"};
                        break;
                    case 30:
                        poem = new String[]{"ای پیرِ خردمند پِگَهْ تر برخیز", "وان کودکِ خاک بیز را بنگر تیز", "پندش ده و گو که، نرم نرمک می بیز", "مغزِ سرِ کیقباد و چشمِ پرویز!"};
                        break;
                    case 31:
                        poem = new String[]{"بنگر ز صبا دامن گل چاک شده", "بلبل ز جمال گُل طَرَبناک شده", "در سایهٔ گل نشین که بسیار این گل", "از خاک برآمده است و در خاک شده!"};
                        break;
                    case 32:
                        poem = new String[]{"می خور که فلک بهر هلاک من و تو", "قصدی دارد به جانِ پاک من و تو", "در سبزه نشین و میِ روشن می خور", "کاین سبزه بسی دمد ز خاک من و تو!"};
                        break;
                    case 33:
                        poem = new String[]{"دیدم به سرِ عمارتی مردی فرد", "کاو گِل به لگد می زد و خوارش می کرد", "وان گِل به زبانِ حال با او می گفت:", "ساکن، که چو من بسی لگد خواهی خورد!"};
                        break;
                    case 34:
                        poem = new String[]{"بردار پیاله و سبو ای دل جو", "برگَرْد به گِردِ سبزه زار و لبِ جو", "کاین چرخ بسی قَدّ ِ بُتانِ مَهْرو", "صد بار پیاله کرد و صد بار سبو!"};
                        break;
                    case 35:
                        poem = new String[]{"بر سنگ زدم دوش سبوی کاشی", "سرمست بدم چو کردم این اوباشی", "با من به زبانِ حال می گفت سبو:", "من چون تو بُدَم، تو نیز چون من باشی!"};
                        break;
                    case 36:
                        poem = new String[]{"زان کوزهٔ میْ که نیست در وی ضرری", "پُر کن قَدَحی بخور، به من دِهْ دگری", "زان پیشتر ای پسر که دررَهْگُذری", "خاک من و تو کوزه کند کوزه گری"};
                        break;
                    case 37:
                        poem = new String[]{"بر کوزه گری پریر کردم گذری", "از خاک همی نمود هر دَم هنری", "من دیدم اگر ندید هر بی بصری", "خاک پدرم در کف هر کوزه گری"};
                        break;
                    case 38:
                        poem = new String[]{"هان کوزه گرا بپای اگر هشیاری", "تا چند کنی بر گِل مردم خواری؟", "انگشتِ فریدون و کَفِ کیخسرو", "برچرخ نهاده ای، چه می پنداری؟"};
                        break;
                    case 39:
                        poem = new String[]{"در کارگه کوزه گری کردم رای", "بر پلهٔ چرخ دیدم استاد به پای", "می کرد دلیر کوزه را دسته و سر", "از کَلّهٔ پادشاه و از دست گدای!"};
                        break;
                    case 40:
                        poem = new String[]{"در کارگهِ کوزه گری بودم دوش", "دیدم دو هزار کوزه گویا و خموش", "هر یک به زبانِ حال با من گفتند:", "«کو کوزه گر و کوزه خر و کوزه فروش؟»"};
                        break;
                    case 41:
                        poem = new String[]{"چون درگذرم به باده شویید مرا", "تلقین ز شرابِ ناب گویید مرا", "خواهید به روز حَشْر یابید مرا؟", "از خاکِ درِ میکده جویید مرا"};
                        break;
                    case 42:
                        poem = new String[]{"چون نبست مقام ما درین دهر مُقیم", "پس بی می و معشوق خطایی است عظیم", "تا کی ز قدیم و مُحْدَث امّیدم و بیم؟", "چون من رفتم، جهان چه مُحْدَث چه قدیم"};
                        break;
                }
                break;
            case 4:
                //زندگی در لحظه
                switch (number) {
                    case 1:
                        poem = new String[]{"گردون نِگَری ز قدِّ فرسودهٔ ماست", "جیحون اثری ز اشکِ پالودهٔ ماست", "دوزخ شَرَری ز رنجِ بیهودهٔ ماست", "فردوس دمی زِ وقتِ آسودهٔ ماست"};
                        break;
                    case 2:
                        poem = new String[]{"اکنون که گل سعادتت پربار است", "دست تو ز جام می چرا بیکار است", "می خور که زمانه دشمنی غدار است", "دریافتن روز چنین دشوار است"};
                        break;
                    case 3:
                        poem = new String[]{"از منزلِ کفر تا به دین، یک نفس است", "وز عالم شک تا به یقین، یک نفس است", "این یک نفسِ عزیز را خوش می دار", "کَز حاصلِ عمرِ ما همین یک نفس است"};
                        break;
                    case 4:
                        poem = new String[]{"با باده نشین، که مُلْکِ محمود این است", "وَزْ چنگ شنو، که لحنِ داوود این است", "از آمده و رفته دگر یاد مکن", "حالی خوش باش، زان که مقصود این است"};
                        break;
                    case 5:
                        poem = new String[]{"می نوش که عمر جاودانی اینست", "خود حاصلت از دور جوانی اینست", "هنگام گل و مُل است و یاران سرمست", "خوش باش دمی، که زندگانی اینست"};
                        break;
                    case 6:
                        poem = new String[]{"چون لاله به نوروز قدح گیر بدست", "با لاله رخی اگر تو را فرصت هست", "می نوش به خرمی که این چرخ کهن", "ناگاه تو را چو خاک گرداند پست"};
                        break;
                    case 7:
                        poem = new String[]{"امروز تورا دسترس فردا نیست", "و اندیشه فردات به جز سودا نیست", "ضایع مکن این دم اَر دلت شیدا نیست", "کاین باقی عمر را بها پیدا نیست"};
                        break;
                    case 8:
                        poem = new String[]{"این یک دو سه روز نوبت عمر گذشت", "چون آب به جویبار و چون باد به دشت", "هرگز غم دو روز مرا یاد نگشت", "روزی که نیامده ست و روزی که گذشت"};
                        break;
                    case 9:
                        poem = new String[]{"چون بلبل مست راه در بستان یافت", "روی گل و جام باده را خندان یافت", "آمد به زبان حال در گوشم گفت", "دریاب که عمر رفته را نتوان یافت"};
                        break;
                    case 10:
                        poem = new String[]{"در خواب بدم مرا خردمندی گفت", "کاز خواب کسی را گل شادی نشکفت", "کاری چه کنی که با اجل باشد جفت؟", "می خور که بسی به خاک می باید خفت"};
                        break;
                    case 11:
                        poem = new String[]{"این قافلهٔ عمر عجب می گذرد!", "دریاب دمی که با طَرَب می گذرد", "ساقی، غم فردای حریفان چه خوری", "پیش آر پیاله را، که شب می گذرد"};
                        break;
                    case 12:
                        poem = new String[]{"گر یک نفست ز زندگانی گذرد", "مگذار که جز به شادمانی گذرد", "هشدار که سرمایه سودای جهان", "عمرست چنان کِه اش گذرانی گذرد"};
                        break;
                    case 13:
                        poem = new String[]{"ای دل غم این جهان فرسوده مخور", "بیهوده نِه ای غمان بیهوده مخور", "چون بوده گذشت و نیست نابوده پدید", "خوش باش غم بوده و نابوده مخور"};
                        break;
                    case 14:
                        poem = new String[]{"ایام زمانه از کسی دارد ننگ", "کو در غم ایام نشیند دلتنگ", "می نوش تو در آبگینه با ناله چنگ", "زان پیش که آبگینه آید بر سنگ"};
                        break;
                    case 15:
                        poem = new String[]{"برخیز ز خواب تا شرابی بخوریم", "زان پیش که از زمانه تابی بخوریم", "کاین چرخ ستیزه روی ناگه روزی", "چندان ندهد زمان که آبی بخوریم"};
                        break;
                    case 16:
                        poem = new String[]{"ای دوست بیا تا غم فردا نخوریم", "واین یک دم عمر را غنیمت شمریم", "فردا که ازین دیْر کُهَن درگذریم", "با هفت هزار سالگان سر به سریم"};
                        break;
                    case 17:
                        poem = new String[]{"از دی که گذشت هیچ ازو یاد مکن", "فردا که نیامده ست فریاد مکن", "برنامده و گذشته بنیاد مکن", "حالی خوش باش و عمر بر باد مکن"};
                        break;
                    case 18:
                        poem = new String[]{"شادی بطلب که حاصلِ عمر دمی است", "هر ذرّه ز خاکِ کیقبادی و جَمی است", "احوالِ جهان و اصلِ این عمر که هست", "خوابی و خیالی و فریبی و دمی است"};
                        break;
                    case 19:
                        poem = new String[]{"مهتاب به نور دامن شب بشکافت", "می نوش، دمی خوشتر از این نتوان یافت", "خوش باش و بیندیش که مهتاب بسی", "اندر سر گور یک به یک خواهد تافت"};
                        break;
                    case 20:
                        poem = new String[]{"صبح است، دمی بر می گلرنگ زنیم", "وین شیشهٔ نام وننگ برسنگ زنیم", "دست از اَمَلِ درازِ خود باز کشیم", "در زلفِ دراز و دامنِ چنگ زنیم"};
                        break;
                    case 21:
                        poem = new String[]{"روزی است خوش و هوا نه گرم است و نه سرد", "ابر از رُخِ گلزار همی شوید گَرْد", "بلبل به زبانِ پهلوی با گلِ زرد", "فریاد همی زند که مِی باید خورد!"};
                        break;
                    case 22:
                        poem = new String[]{"بر چهرهٔ گُل نسیمِ نوروز خوش است", "در صَحنِ چمن رویِ دل افروز خوش است", "از دی که گذشت هرچه گویی خوش نیست", "خوش باش و ز دی مگو، که امروز خوش است"};
                        break;
                    case 23:
                        poem = new String[]{"هر گه که بنفشه جامه در رنگ زند", "در دامنِ گل بادِ صبا چنگ زند", "هشیار کسی بُوَد که، با سیمْبَری", "می نوشد و جام باده بر سنگ زند"};
                        break;
                    case 24:
                        poem = new String[]{"فصلِ گُل و طَرْفِ جویْبار و لبِ کِشْت", "با یک دو سه تازه دلبری حورسرشت", "پیش آر قَدَح که باده نوشانِ صَبوح", "آسوده ز مسجدند و فارغ ز بهشت"};
                        break;
                    case 25:
                        poem = new String[]{"برخیز و مخور غمِ جهانِ گُذران", "خوش باش و دمی به شادمانی گذران", "در طَبْعِ جهان اگر وفایی بودی", "نوبت به تو خود نیامدی از دگران"};
                        break;
                    case 26:
                        poem = new String[]{"ایّامِ زمانه از کسی دارد ننگ", "کاو در غمِ ایّام نشیند دلتنگ", "می خور تو در آبگینه با نالهٔ چنگ", "ز آن پیش که آبگینه آید بر سنگ!"};
                        break;
                    case 27:
                        poem = new String[]{"از آمدنِ بهار و از رفتنِ دی", "اوراقِ وجودِ ما همی گردد طی", "می خور، مخور اندوه، که گفته است حکیم", "غم های جهان چو زَهر و تِریاقش می"};
                        break;
                    case 28:
                        poem = new String[]{"زان پیش که نامِ تو ز عالَم برود", "می خور، که چو می به دل رسد غم برود", "بگشای سرِ زلفِ بُتی بند ز بند", "زان پیش که بند بندت از هم برود!"};
                        break;
                    case 29:
                        poem = new String[]{"تَن زن چو به زیرِ فَلَکِ بی باکی", "می نوش چو در جهانِ آفت ناکی", "چون اوّل و آخِرت به جز خاکی نیست", "انگار که بر خاک نه ای در خاکی"};
                        break;
                    case 30:
                        poem = new String[]{"می بر کفِ من نِهْ که دلم تاب است", "وین عمرِ گریزپای چون سیماب است", "دریاب که، آتشِ جوانی آب است", "هُش دار، که بیداری دولت خواب است"};
                        break;
                    case 31:
                        poem = new String[]{"تا کی غمِ آن خورم که دارم یا نه", "وین عمر به خوشدلی گذارم یا نه", "پر کن قدح باده، که معلومم نیست", "کاین دم که فرو برم بر آرم یا نه"};
                        break;
                    case 32:
                        poem = new String[]{"لب بر لب کوزه بردم از غایت آز", "تا زو طلبم واسطهٔ عمرِ دراز", "لب بر لب من نهاد و می گفت به راز", "می خور، که بدین جهان نمی آیی باز!"};
                        break;
                    case 33:
                        poem = new String[]{"فردا عَلَم نفاق طی خواهم کرد", "با موی سپید قصد مِی خواهم کرد", "پیمانهٔ عمر من به هفتاد رسید", "این دم نکنم نشاط، کِی خواهم کرد؟"};
                        break;
                    case 34:
                        poem = new String[]{"عمرت تا کی به خودپرستی گذرد", "یا در پی نیستی و هستی گذرد", "می نوش که عمریکه اجل در پی اوست", "آن به که به خواب یا به مستی گذرد"};
                        break;
                    case 35:
                        poem = new String[]{"روزی که نهالِ عمر من کنده شود", "و اجزام ز یک دگر پراکنده شود", "گر زان  که صُراحیی کُنند از گِل من", "حالی که ز باده پُر کنی زنده شود"};
                        break;
                    case 36:
                        poem = new String[]{"در پای اجل چو من سرافکنده شوم", "ز بیخ امید عمر بر کنده شوم", "زینهار، گِلَم به جز صراحی نکنید", "باشد که ز بوی می دمی زنده شوم"};
                        break;
                    case 37:
                        poem = new String[]{"یاران به موافقت چو دیدار کنید", "باید که زِ دوست یاد بسیار کنید", "چون بادهٔ خوشگوار نوشید به هم", "نوبت چو به ما رسد نگونسار کنید"};
                        break;
                    case 38:
                        poem = new String[]{"جُز راهِ قَلَندرانِ میخانه مپوی", "جز باده و جز سِماع و جز یار مجوی", "بر کَفْ قَدَحِ باده و بر دوشْ سبو", "می نوش کن ای نگار و بیهوده مگوی"};
                        break;
                    case 39:
                        poem = new String[]{"هنگام سپیده دم خروس سحری", "دانی که چرا همی کند نوحه گری؟", "یعنی که: نمودند در آیینهٔ صبح", "کز عمر شبی گذشت و تو بیخبری!"};
                        break;
                }
                break;
            case 5:
                //درد زندگی
                switch (number) {
                    case 1:
                        poem = new String[]{"امروز که نوبت جوانی من است", "می نوشم از آن که کامرانی من است", "عیبم مکنید. گرچه تلخ است خوش است", "تلخ است، از آن که زندگانی من است"};
                        break;
                    case 2:
                        poem = new String[]{"گر آمدنم به من بُدی، نامَدَمی", "ور نیز شدن به من بدی، کی شدمی؟", "بِهْ زان نَبُدی که اندرین دیْرِ خراب", "نه آمدمی، نه شدمی، نه بُدَمی"};
                        break;
                    case 3:
                        poem = new String[]{"از آمدن و رفتنِ ما سودی کو؟", "وز تارِ وجودِ عمرِ ما پودی کو؟", "در چَنْبَرِ چرخ جان چندین پاکان", "می سوزد و خاک می شود، دودی کو؟"};
                        break;
                    case 4:
                        poem = new String[]{"افسوس که بیفایده فرسوده شدیم", "وَز داسِ سپهرِ سرنگون سوده شدیم", "دردا و ندامتا که تا چشم زدیم", "نابوده به کامِ خویش، نابوده شدیم!"};
                        break;
                    case 5:
                        poem = new String[]{"با یار چو آرمیده باشی همه عمر", "لذاتِ جهان چشیده باشی همه عمر", "هم آخِرِ کار رحلتت خواهد بود", "خوابی باشد که دیده باشی همه عمر"};
                        break;
                    case 6:
                        poem = new String[]{"اکنون که ز خوشدلی به جز نام نمانْد", "یک همدم پخته جز میِ خام نماند", "دستِ طَرَب از ساغرِ می بازمگیر", "امروز که در دست به جز جام نماند!"};
                        break;
                    case 7:
                        poem = new String[]{"ای کاش که جای آرمیدن بودی", "یا این رَهِ دور را رسیدن بودی", "کاش از پیِ صد هزار سال از دل خاک", "چون سبزه امید بر دمیدن بودی!"};
                        break;
                    case 8:
                        poem = new String[]{"چون حاصلِ آدمی درین جایِ دودَر", "جز دردِ دل و دادنِ جان نیست دگر", "خرّم دلِ آن که یک نفس زنده نبود", "و آسوده کسی  که خود نزاد از مادر!"};
                        break;
                    case 9:
                        poem = new String[]{" آن کس که زمین و چرخِ اَفلاک نهاد", "بس داغ که او بر دلِ غمناک نهاد", "بسیار لبِ چو لعل و زُلفینِ چو مشک", "در طَبلِ زمین و حُقّهِٔ خاک نهاد!"};
                        break;
                    case 10:
                        poem = new String[]{"گر بر فَلَکَم دست بُدی چون یزدان", "برداشتمی من این فلک را ز میان", "از نو فلک دگر چُنان ساختمی", "کازاده به کامِ دل رسیدی آسان"};
                        break;
                    case 11:
                        poem = new String[]{"افسوس که نامهٔ جوانی طی شد", "وان تازه بهار زندگانی دی شد", "حالی که ورا نام جوانی گفتند", "معلوم نشد که او کیْ آمد، کیْ شد!"};
                        break;
                    case 12:
                        poem = new String[]{"ای صاحب فتوی، ز تو پرکارتریم", "با این همه مستی، از تو هشیارتریم", "تو خونِ کسان خوری و ما خونِ رَزان", "انصاف بده؛ کدام خونخوارتریم؟"};
                        break;
                    case 13:
                        poem = new String[]{"شیخی به زنی فاحشه گفتا: مستی", "هر لحظه به دام دگری پابستی", "گفتا؛ شیخا، هر آن چه گویی هستم", "آیا تو چنان که می نمایی هستی؟"};
                        break;
                    case 14:
                        poem = new String[]{"نیکی و بدی که در نهادِ بشر است", "شادی و غمی که در قضا و قدر است", "با چرخ مکن حواله کاندر رَهِ عقل", "چرخ از تو هزار بار بیچاره تر است"};
                        break;
                }
            case 6:
                //بی خیالی
                switch (number) {
                    case 1:
                        poem = new String[]{"ای بیخبران شکلِ مُجَسَّم هیچ است", "وین طارَمِ نُهْ سپهرِ اَرْقَم هیچ است", "خوش باش که در نشیمنِ کَوْن  و فَساد", "وابستهٔ یک دمیم و آن هم هیچ است!"};
                        break;
                    case 2:
                        poem = new String[]{"دنیا دیدی و هرچه دیدی هیچ است", "و آن نیز که گفتی و شنیدی هیچ است", "سرتاسرِ آفاق دویدی هیچ است", "و آن نیز که در خانه خزیدی هیچ است"};
                        break;
                    case 3:
                        poem = new String[]{"دنیا به مراد رانده گیر، آخِر چه؟", "وین نامهٔ عمر خوانده گیر، آخِر چه؟", "گیرم که به کامِ دل بماندی صد سال", "صد سال دگر بمانده گیر، آخر چه؟"};
                        break;
                    case 4:
                        poem = new String[]{" رندی دیدم نشسته بر خِنْگِ زمین", "نه کفر و نه اسلام و نه دنیا و نه دین", "نی حق، نه حقیقت، نه شریعت نه یقین", "اندر دو جهان کرا بُوَد زَهرهٔ این؟"};
                        break;
                    case 5:
                        poem = new String[]{"این چرخِ فلک که ما در او حیرانیم", "فانوس خیال از او مثالی دانیم:", "خورشیدْ چراغ دان و عالَم فانوس،", "ما چون صُوَریم کاندر او گَردانیم"};
                        break;
                    case 6:
                        poem = new String[]{"چون نیست زِ هرچه هست جُز باد به دست", "چون هست زِ هرچه هست نُقصان و شکست", "انگار که هست، هرچه در عالَم نیست", "پندار که نیست، هرچه در عالَم هست"};
                        break;
                    case 7:
                        poem = new String[]{"بنگر ز جهان چه طَرْف بربستم؟ هیچ", "وَز حاصلِ عمر چیست در دستم؟ هیچ", "شمعِ طَرَبم، ولی چو بنشستم، هیچ", "من جامِ جَمَم، ولی چو بشکستم، هیچ"};
                        break;
                    case 8:
                        poem = new String[]{"گر من ز می مُغانه مستم، هستم", "گر کافِر و گَبْر و بت پرستم، هستم", "هر طایفه ای به من گمانی دارد", "من زانِ خودم، چُنان که هستم هستم"};
                        break;
                    case 9:
                        poem = new String[]{"می خوردن و شاد بودن آیین من است", "فارغ بودن ز کفر و دین؛ دین من است", "گفتم به عروسِ دَهْر: کابین تو چیست؟", "گفتا: دلِ خرّمِ تو کابینِ من است"};
                        break;
                    case 10:
                        poem = new String[]{"من بی می ناب زیستن نتوانم", "بی باده، کشیدِ بارِ تن نتوانم", "من بندهٔ آن دَمَم که ساقی گوید:", "«یک جام دگر بگیر» و من نتوانم"};
                        break;
                    case 11:
                        poem = new String[]{"امشب می جامِ یک مَنی خواهم کرد", "خود را به دو جامِ می غنی خواهم کرد", "اول سه طلاقِ عقل و دین خواهم داد", "پس دخترِ رَز را به زنی خواهم کرد"};
                        break;
                    case 12:
                        poem = new String[]{"چون مُرده شوم، خاکِ مرا گُم سازید", "احوالِ مرا عبرتِ مردم سازید", "خاک تن من به باده آعشته کنید", "وَز کالبدم خشتِ سَرِ خُم سازید"};
                        break;
                    case 13:
                        poem = new String[]{"چندان بخورم شراب، کاین بوی شراب", "آید ز تُراب، چون روم زیرِ تُراب", "گر بر سر خاک من رسد مَخموری", "از بوی شراب من شود مست و خراب"};
                        break;
                    case 14:
                        poem = new String[]{"آنان که اسیر عقل و تمییز شدند", "در حسرتِ هست ونیست ناچیز شدند", "رو با خبرا، تو آب انگور گُزین", "کان بی خبران به غوره مِیْویز شدند!"};
                        break;
                    case 15:
                        poem = new String[]{"از من رَمَقی به سعی ساقی مانده است", "وَزْ صحبتِ خلق، بی وفاقی مانده است", "از بادهٔ دوشین قَدَحی بیش نماند", "از عمر ندانم که چه باقی مانده است!"};
                        break;
                    case 16:
                        poem = new String[]{"تا دست به اتفاق بر هم نزنیم", "پایی ز نشاط بر سر غم نزنیم", "خیزیم و دمی زنیم پیش از دمِ صبح", "کاین صبح بسی دمد که ما دَم نزنیم!"};
                        break;
                    case 17:
                        poem = new String[]{"دوْرانِ جهان بی می و ساقی هیچ است", "بی زمزمهٔ نایِ عراقی هیچ است", "هر چند در احوال جهان می نگرم", "حاصل همه عشرت است و باقی هیچ است"};
                        break;
                    case 18:
                        poem = new String[]{"چون عهده نمی شود کسی فردا را", "حالی خوش کن تو این دلِ سودا را", "می نوش به ماهتاب، ای ماه که ماه", "بسیار بگردد و نیابد ما را"};
                        break;
                    case 19:
                        poem = new String[]{"تا زُهره و مَهْ در آسمان گشته پدید", "بهتر ز میِ ناب کسی هیچ ندید", "من در عجبم ز می فروشان، کایشان", "زین بِهْ که فروشند چه خواهند خرید؟"};
                        break;
                }
        }
        return poem;
    }
}
